src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <owners>Catalog.Кластеры1С</owners>
  <attributes>
    <name>ИмяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверБД</name>
    <type>
      <types>CatalogRef.СерверыБД</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВКластере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКонфигурации</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебСервер</name>
    <type>
      <types>CatalogRef.ВебСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>ПользовательГруппа</name>
      <type>
        <types>CatalogRef.ПользователиИБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>ИмяРасширения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеРасширения</name>
      <type>
        <types>CatalogRef.ХранилищаКонфигураций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WebСервисы</name>
    <attributes>
      <name>ИмяСервиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>HTTPСервисы</name>
    <attributes>
      <name>ИмяСервиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВебСерверы</name>
    <attributes>
      <name>ВебСервер</name>
      <type>
        <types>CatalogRef.ВебСерверы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СтатусыИнформационнойБазы/СтатусыИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформационнойБазы</name>
  <enumValues>
    <name>ВПодготовке</name>
  </enumValues>
  <enumValues>
    <name>Отключена</name>
  </enumValues>
  <enumValues>
    <name>Активна</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.ВПодготовке;
	ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторБазы) Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.Отключена;
	ИначеЕсли Статус = Перечисления.СтатусыИнформационнойБазы.Активна Тогда
		// Статус остается	
	Иначе
		Статус = Перечисления.СтатусыИнформационнойБазы.Активна;	
	КонецЕсли;  
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
		ПараметрыЗапускаПоУмолчанию = Новый Структура;
		ПараметрыЗапускаПоУмолчанию.Вставить("ВариантАутентификации",				0);
		ПараметрыЗапускаПоУмолчанию.Вставить("Версия",								"8.3");
		ПараметрыЗапускаПоУмолчанию.Вставить("ДополнительныеПараметрыЗапуска",	"");
		ПараметрыЗапускаПоУмолчанию.Вставить("ОсновнойРежимЗапуска",				"Auto");
		ПараметрыЗапускаПоУмолчанию.Вставить("Разрядность", 						"x86_64_prt");
		
		ПараметрыЗапуска = Новый ХранилищеЗначения(ПараметрыЗапускаПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры     

Функция ПроверитьЗаполнениеРеквизитов()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ИмяИБ");
	МассивРеквизитов.Добавить("СерверБД");
	МассивРеквизитов.Добавить("БазаДанных");
	МассивРеквизитов.Добавить("Назначение");
	МассивРеквизитов.Добавить("Ответственный");

	Для Каждого ПроверяемыйРеквизит Из МассивРеквизитов Цикл
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ПроверяемыйРеквизит]) Тогда
			Возврат Ложь;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // ПроверитьЗаполнениеРеквизитов()
